In [16]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine, text
import getpass  # To get the password without showing the input
password = getpass.getpass()

### 1. Establish a connection between Python and the Sakila database.

In [17]:
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [19]:
# Testing the connection and running a first query
with engine.connect() as connection:
    query = text('SELECT * FROM city')
    result = connection.execute(query)

row = result.first()
row

(1, 'A Coruña (La Coruña)', 87, datetime.datetime(2006, 2, 15, 4, 45, 25))

### 2. Write a Python function called `rentals_month`.
The `rentals_month` function that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
month: an integer representing the month for which rental data is to be retrieved.
year: an integer representing the year for which rental data is to be retrieved.
The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.The

In [20]:
def rentals_month(engine, month, year):
    """
    Retrieves rental data for a specific month and year from the Sakila database.
    
    Parameters:
    engine : SQLAlchemy engine object
        Database connection engine to Sakila DB
    month : int
        Month number (1-12)
    year : int
        Year (e.g., 2005)
        
    Returns:
    pd.DataFrame : rental records for given month/year
    """
    
    query = text("""
        SELECT *
        FROM rental
        WHERE MONTH(rental_date) = :month
          AND YEAR(rental_date) = :year
    """)
    
    # execute the query with parameters and load into DataFrame
    df = pd.read_sql(query, engine, params={"month": month, "year": year})
    return df

In [34]:
df = rentals_month(engine, 6, 2005)
df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
2306,3465,2005-06-21 22:10:01,1488,510,2005-06-30 21:35:01,1,2006-02-15 21:30:53
2307,3466,2005-06-21 22:13:33,371,226,2005-06-25 21:01:33,2,2006-02-15 21:30:53
2308,3467,2005-06-21 22:19:25,729,543,2005-06-27 00:03:25,2,2006-02-15 21:30:53
2309,3468,2005-06-21 22:43:45,2899,100,2005-06-30 01:49:45,1,2006-02-15 21:30:53
2310,3469,2005-06-21 22:48:59,4087,181,2005-06-28 19:32:59,1,2006-02-15 21:30:53

### 3. Develop a Python function called `rental_count_month`
Develop a Python function called `rental_count_month` that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

In [31]:
def rental_count_month(df, month, year):
    """
    Counts the number of rentals made by each customer_id during a specific month and year.
    
    Parameters:
    df : pd.DataFrame
        DataFrame containing rental records
    month : int
        Month number (1-12)
    year : int
        Year (e.g., 2005)
        
    Returns:
    pd.DataFrame : DataFrame with customer_id and rental count for the specified month/year
    """
    
    # Group by customer_id and count rentals
    rental_counts = df.groupby('customer_id').size().reset_index(name='rental_count')
    
    # Create new column name based on month and year
    column_name = f'rentals_{month:02d}_{year}'
    
    # Rename the rental_count column to the new name
    rental_counts.rename(columns={'rental_count': column_name}, inplace=True)
    
    return rental_counts

In [33]:
df1 = rental_count_month(df, 5, 2005)
df1

     customer_id  rentals_05_2005
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]

In [35]:
df2 = rental_count_month(df, 6, 2005)
df2

     customer_id  rentals_06_2005
0              1                7
1              2                1
2              3                4
3              4                6
4              5                5
..           ...              ...
585          595                2
586          596                2
587          597                3
588          598                1
589          599                4

[590 rows x 2 columns]

### 4. Create a Python function called `compare_rentals`
Create a Python function called `compare_rentals` that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [45]:
def compare_rentals(df1, df2):
    """
    Compares the number of rentals made by each customer in two different months and years.
    
    Parameters:
    df1 : pd.DataFrame
        DataFrame containing rental counts for the first month/year
    df2 : pd.DataFrame
        DataFrame containing rental counts for the second month/year
        
    Returns:
    pd.DataFrame : Combined DataFrame with a 'difference' column
    """
    
    # Merge the two DataFrames on customer_id
    combined_df = pd.merge(df1, df2, on='customer_id')
    
    # Calculate the difference between the two rental counts
    combined_df['difference'] = combined_df.columns[1] - combined_df.columns[2]
    
    return combined_df

In [46]:
compare_rentals(df1, df2)

TypeError: unsupported operand type(s) for -: 'str' and 'str'